nxp-mcuxpresso/mcux-soc-svd/MCXN236/MCXN236.xml
        <register>
          <name>ELS_AS_CFG1</name>
          <description>ELS AS Configuration1</description>
          <addressOffset>0x9D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x140002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_SEC_DIS_STRICT_MODE</name>
              <description>When CFG_SEC_ENA_SEC_CHK indicates state 0 or when DISABLE_STRICT_MODE bits in MISC_CTRL_REG and MISC_CTRL_DP_REG on the AHB secure controller are equal to 01, this bit indicates state 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_DIS_VIOL_ABORT</name>
              <description>When the DISABLE_VIOLATION_ABORT bits in MISC_CTRL_REG and MISC_CTRL_DP_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_ENA_NS_PRIV_CHK</name>
              <description>When the ENABLE_NS_PRIV_CHECK bits in MISC_CTRL_REG and MISC_CTRL_DP_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_ENA_S_PRIV_CHK</name>
              <description>When the ENABLE_S_PRIV_CHECK bits in MISC_CTRL_REG and MISC_CTRL_DP_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_ENA_SEC_CHK</name>
              <description>When the ENABLE_SECURE_CHECKING bits in MISC_CTRL_REG and MISC_CTRL_DP_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_IDAU_ALLNS</name>
              <description>When the IDAU_ALL_NS bits in MISC_CTRL_REG and MISC_CTRL_DP_REG on the AHB secure controller are equal to 01, this bit indicates state 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_NS_MPU</name>
              <description>When the LOCK_NS_MPU bits in CPU0_LOCK_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_NS_VTOR</name>
              <description>When the LOCK_NS_VTOR bits in CPU0_LOCK_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_S_MPU</name>
              <description>When the LOCK_S_MPU bits in CPU0_LOCK_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_S_VTAIRCR</name>
              <description>When the LOCK_S_VTAIRCR bits in CPU0_LOCK_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_SEC_LOCK_SAU</name>
              <description>When the LOCK_SAU bits in CPU0_LOCK_REG on the AHB secure controller are not equal to 10, this bit indicates state 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>METAL_VERSION</name>
              <description>metal version</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROM_PATCH_VERSION</name>
              <description>ROM patch version</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_HVD_CORE_RESET_ENABLED</name>
              <description>When SPC CORE HVD analog detector are turned on, and CORE HVD reset are enabled, this bit indicates state 1.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_HVD_CORE_IRQ_ENABLED</name>
              <description>When SPC CORE HVD analog detector are turned on, and CORE HVD IRQ are enabled, this bit indicates state 1.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_HVD_VSYS_RESET_ENABLED</name>
              <description>When SPC VSYS HVD analog detector are turned on and VSYS HVD reset are enabled, this bit indicates state 1.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_HVD_VDDIO_RESET_ENABLED</name>
              <description>When SPC VDDIO HVD analog detector are turned on and VDDIO HVD reset are enabled, this bit indicates state 1.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_HVD_VSYS_IRQ_ENABLED</name>
              <description>When SPC VSYS HVD analog detector are turned on and VSYS HVD irq are enabled, this bit indicates state 1.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFG_HVD_VDDIO_IRQ_ENABLED</name>
              <description>When SPC VDDIO HVD analog detector are turned on and VDDIO HVD irq are enabled, this bit indicates state 1.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_CFG2</name>
          <description>ELS AS Configuration2</description>
          <addressOffset>0x9D8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_ELS_CMD_EN</name>
              <description>ELS configuration command enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_CFG3</name>
          <description>ELS AS Configuration3</description>
          <addressOffset>0x9DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DEVICE_TYPE</name>
              <description>Device type identification data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_ST0</name>
          <description>ELS AS State Register</description>
          <addressOffset>0x9E0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_TEMPORAL_STATE</name>
              <description>TEMPORAL_STATE[3:0] in the ELS_TEMPORAL_STATE register reflects this register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_CPU0_DBGEN</name>
              <description>When CPU0 (CM33) &quot;deben&quot; input is state 1, this bit indicates state 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_CPU0_NIDEN</name>
              <description>When CPU0 (CM33) &quot;niden&quot; input is state 1, this bit indicates state 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_CPU0_SPIDEN</name>
              <description>When CPU0 (CM33) &quot;spiden&quot; input is state 1, this bit indicates state 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_CPU0_SPNIDEN</name>
              <description>When CPU0 (CM33) &quot;spniden&quot; input is state 1, this bit indicates state 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_DAP_ENABLE_CPU0</name>
              <description>When DAP to AP0 for CPU0 (CM33) debug access is allowed, this bit indicates state 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_ALLOW_TEST_ACCESS</name>
              <description>When JTAG TAP access is allowed, this bit indicates state 1.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_XO32K_FAILED</name>
              <description>When XO32K oscillation fail flag is state 1, this bit indicates state 1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_XO40M_FAILED</name>
              <description>When XO40M oscillation fail flag is state 1, this bit indicates state 1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_IFR_LOAD_FAILED</name>
              <description>When IFR load fail flag is state 1, this bit indicates state 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_GLITCH_DETECT_FLAG</name>
              <description>GLITCH_DETECT_FLAG is state of 4-bit Glitch Ripple Counter output.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_ST1</name>
          <description>ELS AS State1</description>
          <addressOffset>0x9E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x5024F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ST_QK_PUF_SCORE</name>
              <description>These register bits indicate the state of &quot;qk_puf_score[3:0]&quot; outputs from QK PUF block</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_QK_ZEROIZED</name>
              <description>This register bit indicates the state of &quot;qk_zeroized&quot; output from QK PUF block</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_MAIN_CLK_IS_EXT</name>
              <description>When MAIN_CLK is running from external clock source either XO32M, XO32K or GPIO CLKIN, this bit indicates state 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_DCDC_VOUT</name>
              <description>VOUT[1:0] setting on DCDC0 register in SPC block will reflect to this register. Default is 1.0V</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_DCDC_DS</name>
              <description>DCDC drive strength setting. Default is normal drive.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_BOOT_MODE</name>
              <description>ISP pin status during boot. By default ISP pin is pulled up. If want to enter ISP mode during boot, ISP pin should be pull down when out of reset.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_BOOT_RETRY_CNT</name>
              <description>BOOT_RETRY_CNT[3:0] in the ELS_BOOT_RETRY_CNT register reflects this register</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_LDO_CORE_VOUT</name>
              <description>VOUT[1:0] setting on LDO Core register in SPC block will reflect to this register. Default is 1.0V</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ST_LDO_CORE_DS</name>
              <description>LDO_CORE drive strength setting. Default is normal drive.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ELS_AS_BOOT_LOG0</name>
          <description>Boot state captured during boot: Main ROM log</description>
          <addressOffset>0x9E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BOOT_IMAGE</name>
              <description>Boot image source used during this boot.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM0</name>
                  <description>Internal flash image 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM1</name>
                  <description>Internal flash image 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM2</name>
                  <description>FlexSPI flash image 0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM3</name>
                  <description>FlexSPI flash image 1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM4</name>
                  <description>Recovery SPI flash image</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM5</name>
                  <description>Serial boot image (write-memory and execute ISP command used)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM6</name>
                  <description>Receive SB3 containing SB_JUMP command is used.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM7</name>
                  <description>Customer SBL/recovery image (Bank1 IFR0).</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM8</name>
                  <description>NXP MAD recovery image (Bank1 IFR0).</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM9</name>
                  <description>NXP ROM extension (NMPA - Bank0 IFR0).</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMAC</name>
              <description>CMAC verify is used instead of ECDSA verify on this boot.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECDSA</name>
              <description>ECDSA P-384 verification is done on this boot.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OFF_CHIP</name>
              <description>Off-chip Prince is enabled during boot.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ON_CHIP</name>
              <description>On-chip Prince is enabled during boot.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CDI_CSR</name>
              <description>CDI based device keys are derived for CSR harvesting on this boot.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CDI_DICE</name>
              <description>CDI per DICE specification is computed on this boot.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRUSTZONE</name>
              <description>TrustZone preset data is loaded during this boot.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEBUG_AUTH</name>
              <description>Debug authentication done in this session prior to boot.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ITRC</name>
              <description>ITRC zeroize event is handled in this session of boot.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIG_GDET</name>
              <description>Digital glitch detector is enabled during boot.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ANA_GDET</name>
              <description>Analog glitch detector is enabled during boot.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DEEP_PD</name>
              <description>Boot from deep-power down state.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOW_POWER</name>
              <description>Last low-power mode value. ROM copies SPC_LP_MODE field from SPC-&gt;SC[7:4].</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISP</name>
              <description>ISP pin state at boot time. ROM copies CMC-&gt;MR0[0].</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
