nxp-mcuxpresso/mcux-soc-svd/MCXN236/MCXN236.xml
        <register>
          <name>APB_PERIPHERAL_GROUP0_MEM_RULE0</name>
          <description>APB Bridge Group 0 Memory Rule 0</description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYSCON</name>
              <description>SYSCON</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINT0</name>
              <description>PINT0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUTMUX</name>
              <description>INPUTMUX</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_PERIPHERAL_GROUP0_MEM_RULE1</name>
          <description>APB Bridge Group 0 Memory Rule 1</description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTIMER0</name>
              <description>CTIMER0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIMER1</name>
              <description>CTIMER1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIMER2</name>
              <description>CTIMER2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTIMER3</name>
              <description>CTIMER3</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_PERIPHERAL_GROUP0_MEM_RULE2</name>
          <description>APB Bridge Group 0 Rule 2</description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTIMER4</name>
              <description>CTIMER4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQME0</name>
              <description>FREQME0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UTCIK0</name>
              <description>UTCIK0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRT0</name>
              <description>MRT0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSTIMER0</name>
              <description>OSTIMER0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WWDT0</name>
              <description>WWDT0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WWDT1</name>
              <description>WWDT1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_PERIPHERAL_GROUP0_MEM_RULE3</name>
          <description>APB Bridge Group 0 Memory Rule 3</description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CACHE64_POLSEL0</name>
              <description>CACHE64_POLSEL0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Non-secure and non-privilege user access allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE_PRIV_USER_ALLOWED</name>
                  <description>Non-secure and privilege access allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_NONPRIV_USER_ALLOWED</name>
                  <description>Secure and non-privilege user access allowed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE_PRIV_USER_ALLOWED</name>
                  <description>Secure and privilege user access allowed</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
